<a href="https://colab.research.google.com/github/soumodeep60/SQL/blob/main/MySQL_notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**MySQL working**

Data base is stored in authors drive\
Author- Soumodeep Das\
*soumodeep.das@praxis.ac.in*

View other works on GitHub: *https://github.com/soumodeep60*

* Install MySQL server
* Loading data base

In [ ]:
!apt-get update > null
!apt-get -y install mysql-server > null

In [ ]:
!/etc/init.d/mysql restart

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.

In [ ]:
!mysql --version

mysql  Ver 14.14 Distrib 5.7.39, for Linux (x86_64) using  EditLine wrapper

Creating database as Soumo_DB

In [ ]:
!mysql -e 'create database Soumo_DB'

In [ ]:
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| information_schema |
| Soumo_DB           |
| mysql              |
| performance_schema |
| sys                |
+--------------------+

We are using !gdown function to download the data base directly from the link

In [ ]:
!gdown  https://drive.google.com/uc?id=1rCDmfQ2Mjc5_s6BwRrd7EV9AxbGEnK0s
!gdown  https://drive.google.com/uc?id=11hvDdwhPpa9D7UcAFiKQ0xZz2A-gy6IE

Downloading...
From: https://drive.google.com/uc?id=1rCDmfQ2Mjc5_s6BwRrd7EV9AxbGEnK0s
To: /content/emp.csv
100% 734/734 [00:00<00:00, 490kB/s]
Downloading...
From: https://drive.google.com/uc?id=11hvDdwhPpa9D7UcAFiKQ0xZz2A-gy6IE
To: /content/dept.csv
100% 148/148 [00:00<00:00, 163kB/s]

In [ ]:
!ls

dept.csv  emp.csv  null  sample_data

In [ ]:
!mysql Soumo_DB -e 'drop table empl'
!mysql Soumo_DB -e 'create table empl (empid char(6),lastname varchar(20), firstname varchar(20), jobdesc varchar(10), joindate date, salary int, comm decimal(3,2), deptid char(2));'
!mysql Soumo_DB -e 'drop table dept'
!mysql Soumo_DB -e 'create table dept (deptid char(2),deptname varchar(20), managerid char(6), location varchar(10));'

ERROR 1051 (42S02) at line 1: Unknown table 'Soumo_DB.empl'
ERROR 1051 (42S02) at line 1: Unknown table 'Soumo_DB.dept'

In [ ]:
!mysql Soumo_DB -e 'desc empl'
!mysql Soumo_DB -e 'desc dept'

+-----------+--------------+------+-----+---------+-------+
| Field     | Type         | Null | Key | Default | Extra |
+-----------+--------------+------+-----+---------+-------+
| empid     | char(6)      | YES  |     | NULL    |       |
| lastname  | varchar(20)  | YES  |     | NULL    |       |
| firstname | varchar(20)  | YES  |     | NULL    |       |
| jobdesc   | varchar(10)  | YES  |     | NULL    |       |
| joindate  | date         | YES  |     | NULL    |       |
| salary    | int(11)      | YES  |     | NULL    |       |
| comm      | decimal(3,2) | YES  |     | NULL    |       |
| deptid    | char(2)      | YES  |     | NULL    |       |
+-----------+--------------+------+-----+---------+-------+
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| deptid    | char(2)     | YES  |     | NULL    |       |
| deptname  | varchar(20) | YES  |     | NULL    |       |
| managerid | char(6)     | YES  |     | NULL    |       |
| location  | varchar(10) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+

In [ ]:
!mysql Soumo_DB -e "LOAD DATA LOCAL INFILE 'emp.csv' INTO TABLE empl FIELDS TERMINATED BY ',' IGNORE 1 LINES;"

In [ ]:
!mysql Soumo_DB -e "LOAD DATA LOCAL INFILE 'dept.csv' INTO TABLE dept FIELDS TERMINATED BY ',' LINES TERMINATED BY '\r\n'  IGNORE 1 LINES;"

**Employee** **table**:

In [ ]:
!mysql Soumo_DB -e 'select * from empl'

+--------+-------------+-----------+------------+------------+--------+------+--------+
| empid  | lastname    | firstname | jobdesc    | joindate   | salary | comm | deptid |
+--------+-------------+-----------+------------+------------+--------+------+--------+
| 742866 | Bacchan     | Amitabh   | Executive  | 2003-03-10 |  50000 | 0.10 | 10     |
| 349870 | Mukherjee   | Rani      | Manager    | 2005-05-04 |  25000 | 0.06 | 40     |
| 865477 | Dikshit     | Madhuri   | Clerk      | 2002-04-04 |  10000 | 0.02 | 20     |
| 239456 | Khan        | Shahrukh  | Manager    | 2004-01-03 |  30000 | 0.07 | 20     |
| 897889 | Sehwag      | Virender  | Cus_Rep    | 2005-01-02 |  15000 | 0.05 | 20     |
| 123980 | Dhoni       | Mahender  | Clerk      | 2004-10-09 |   9000 | 0.02 | 40     |
| 822134 | Dravid      | Rahul     | Sr Manager | 2000-06-04 |  40000 | 0.08 | 30     |
| 997445 | Dalmia      | Jagmohan  | Clerk      | 2001-07-01 |  12000 | 0.02 | 30     |
| 989007 | Ganguly     | Sourav    | Cus_Rep    | 2002-01-01 |  20000 | 0.03 | 40     |
| 299034 | Ganesan     | Rekha     | Director   | 2002-10-10 |  60000 | 0.11 | 10     |
| 546223 | Karthikeyan | Narayan   | Secretary  | 2005-12-04 |  40000 | 0.09 | 10     |
| 223112 | Mirza       | Sania     | Cus_Rep    | 2001-11-19 |  25000 | 0.04 | 30     |
+--------+-------------+-----------+------------+------------+--------+------+--------+

**Department** **table**:

In [ ]:
!mysql Soumo_DB -e 'select * from dept'

+--------+------------+-----------+----------+
| deptid | deptname   | managerid | location |
+--------+------------+-----------+----------+
| 10     | Corporate  | 299034    | Calcutta |
| 20     | Sales      | 239456    | Calcutta |
| 30     | Accounts   | 822134    | Calcutta |
| 40     | Production | 349870    | Bombay   |
+--------+------------+-----------+----------+

# **Aggregate** **funtions**

**Count** **Funtion**:

In [ ]:
!mysql Soumo_DB -e 'select count(empid) from empl'

+--------------+
| count(empid) |
+--------------+
|           12 |
+--------------+

In [ ]:
!mysql Soumo_DB -e 'select count(deptid) from dept'

+---------------+
| count(deptid) |
+---------------+
|             4 |
+---------------+

**Sum** **Function**:

In [ ]:
!mysql Soumo_DB -e 'select sum(salary) from empl'

+-------------+
| sum(salary) |
+-------------+
|      336000 |
+-------------+

**Group** **BY**:

In [ ]:
!mysql Soumo_DB -e 'select jobdesc,sum(salary) from empl group by jobdesc'

+------------+-------------+
| jobdesc    | sum(salary) |
+------------+-------------+
| Clerk      |       31000 |
| Cus_Rep    |       60000 |
| Director   |       60000 |
| Executive  |       50000 |
| Manager    |       55000 |
| Secretary  |       40000 |
| Sr Manager |       40000 |
+------------+-------------+

**Average**:

In [ ]:
!mysql Soumo_DB -e 'select avg(salary) from empl'

+-------------+
| avg(salary) |
+-------------+
|  28000.0000 |
+-------------+

**Min** **Max**:

In [ ]:
!mysql Soumo_DB -e 'select min(salary) from empl'

+-------------+
| min(salary) |
+-------------+
|        9000 |
+-------------+

In [ ]:
!mysql Soumo_DB -e 'select max(salary) from empl'

+-------------+
| max(salary) |
+-------------+
|       60000 |
+-------------+

# **Mathemetical** **functions**

**Ceil and Floor functions:**
* ceil is for higher integer
* floor is for lower integer

In [43]:
!mysql Soumo_DB -e 'select firstname,salary,ceil(salary) as ceil,floor(salary) as floor from empl'

+-----------+--------+-------+-------+
| firstname | salary | ceil  | floor |
+-----------+--------+-------+-------+
| Amitabh   |  50000 | 50000 | 50000 |
| Rani      |  25000 | 25000 | 25000 |
| Madhuri   |  10000 | 10000 | 10000 |
| Shahrukh  |  30000 | 30000 | 30000 |
| Virender  |  15000 | 15000 | 15000 |
| Mahender  |   9000 |  9000 |  9000 |
| Rahul     |  40000 | 40000 | 40000 |
| Jagmohan  |  12000 | 12000 | 12000 |
| Sourav    |  20000 | 20000 | 20000 |
| Rekha     |  60000 | 60000 | 60000 |
| Narayan   |  40000 | 40000 | 40000 |
| Sania     |  25000 | 25000 | 25000 |
+-----------+--------+-------+-------+

**Turncate**:

In [46]:
!mysql Soumo_DB -e 'select firstname,salary,truncate(salary,1) from empl'

+-----------+--------+--------------------+
| firstname | salary | truncate(salary,1) |
+-----------+--------+--------------------+
| Amitabh   |  50000 |              50000 |
| Rani      |  25000 |              25000 |
| Madhuri   |  10000 |              10000 |
| Shahrukh  |  30000 |              30000 |
| Virender  |  15000 |              15000 |
| Mahender  |   9000 |               9000 |
| Rahul     |  40000 |              40000 |
| Jagmohan  |  12000 |              12000 |
| Sourav    |  20000 |              20000 |
| Rekha     |  60000 |              60000 |
| Narayan   |  40000 |              40000 |
| Sania     |  25000 |              25000 |
+-----------+--------+--------------------+

**Modulo**:\
checking that the slary is in even number or odd number

In [48]:
!mysql Soumo_DB -e 'select firstname,salary,mod(salary,2) as modulo from empl'

+-----------+--------+--------+
| firstname | salary | modulo |
+-----------+--------+--------+
| Amitabh   |  50000 |      0 |
| Rani      |  25000 |      0 |
| Madhuri   |  10000 |      0 |
| Shahrukh  |  30000 |      0 |
| Virender  |  15000 |      0 |
| Mahender  |   9000 |      0 |
| Rahul     |  40000 |      0 |
| Jagmohan  |  12000 |      0 |
| Sourav    |  20000 |      0 |
| Rekha     |  60000 |      0 |
| Narayan   |  40000 |      0 |
| Sania     |  25000 |      0 |
+-----------+--------+--------+

# **String funtions**

**Upper and Lower case:**

In [50]:
!mysql Soumo_DB -e 'select upper(location) from dept'

+-----------------+
| upper(location) |
+-----------------+
| CALCUTTA        |
| CALCUTTA        |
| CALCUTTA        |
| BOMBAY          |
+-----------------+

In [51]:
!mysql Soumo_DB -e 'select lower(location) from dept'

+-----------------+
| lower(location) |
+-----------------+
| calcutta        |
| calcutta        |
| calcutta        |
| bombay          |
+-----------------+

**Concat:**

In [55]:
!mysql Soumo_DB -e 'select concat(firstname," ",lastname) as name from empl'

+---------------------+
| name                |
+---------------------+
| Amitabh Bacchan     |
| Rani Mukherjee      |
| Madhuri Dikshit     |
| Shahrukh Khan       |
| Virender Sehwag     |
| Mahender Dhoni      |
| Rahul Dravid        |
| Jagmohan Dalmia     |
| Sourav Ganguly      |
| Rekha Ganesan       |
| Narayan Karthikeyan |
| Sania Mirza         |
+---------------------+

We are not using trim function here as all the space are quite well.

# **Date and time function:**

**date function:**
* Time function is not used as our table doesn't contains any time.

In [57]:
!mysql Soumo_DB -e 'select firstname,date(joindate) as date from empl'

+-----------+------------+
| firstname | date       |
+-----------+------------+
| Amitabh   | 2003-03-10 |
| Rani      | 2005-05-04 |
| Madhuri   | 2002-04-04 |
| Shahrukh  | 2004-01-03 |
| Virender  | 2005-01-02 |
| Mahender  | 2004-10-09 |
| Rahul     | 2000-06-04 |
| Jagmohan  | 2001-07-01 |
| Sourav    | 2002-01-01 |
| Rekha     | 2002-10-10 |
| Narayan   | 2005-12-04 |
| Sania     | 2001-11-19 |
+-----------+------------+

**Extract function:**

In [60]:
!mysql Soumo_DB -e 'select firstname,extract(year from joindate) as year,extract(month from joindate) as month,extract(day from joindate) as day from empl'

+-----------+------+-------+------+
| firstname | year | month | day  |
+-----------+------+-------+------+
| Amitabh   | 2003 |     3 |   10 |
| Rani      | 2005 |     5 |    4 |
| Madhuri   | 2002 |     4 |    4 |
| Shahrukh  | 2004 |     1 |    3 |
| Virender  | 2005 |     1 |    2 |
| Mahender  | 2004 |    10 |    9 |
| Rahul     | 2000 |     6 |    4 |
| Jagmohan  | 2001 |     7 |    1 |
| Sourav    | 2002 |     1 |    1 |
| Rekha     | 2002 |    10 |   10 |
| Narayan   | 2005 |    12 |    4 |
| Sania     | 2001 |    11 |   19 |
+-----------+------+-------+------+

extractions can be done from date:

![image.png]()

In [68]:
!mysql Soumo_DB -e 'select firstname,extract(week from joindate) as week,extract(quarter from joindate) as quarter from empl'

+-----------+------+---------+
| firstname | week | quarter |
+-----------+------+---------+
| Amitabh   |   10 |       1 |
| Rani      |   18 |       2 |
| Madhuri   |   13 |       2 |
| Shahrukh  |    0 |       1 |
| Virender  |    1 |       1 |
| Mahender  |   40 |       4 |
| Rahul     |   23 |       2 |
| Jagmohan  |   26 |       3 |
| Sourav    |    0 |       1 |
| Rekha     |   40 |       4 |
| Narayan   |   49 |       4 |
| Sania     |   46 |       4 |
+-----------+------+---------+

**Date format:**

In [72]:
!mysql Soumo_DB -e 'select firstname,date_format(joindate,"%d %b %y") as week from empl'

+-----------+-----------+
| firstname | week      |
+-----------+-----------+
| Amitabh   | 10 Mar 03 |
| Rani      | 04 May 05 |
| Madhuri   | 04 Apr 02 |
| Shahrukh  | 03 Jan 04 |
| Virender  | 02 Jan 05 |
| Mahender  | 09 Oct 04 |
| Rahul     | 04 Jun 00 |
| Jagmohan  | 01 Jul 01 |
| Sourav    | 01 Jan 02 |
| Rekha     | 10 Oct 02 |
| Narayan   | 04 Dec 05 |
| Sania     | 19 Nov 01 |
+-----------+-----------+

In [112]:
!mysql Soumo_DB -e 'select * from empl'

+--------+-------------+-----------+------------+------------+--------+------+--------+
| empid  | lastname    | firstname | jobdesc    | joindate   | salary | comm | deptid |
+--------+-------------+-----------+------------+------------+--------+------+--------+
| 742866 | Bacchan     | Amitabh   | Executive  | 2003-03-10 |  50000 | 0.10 | 10     |
| 349870 | Mukherjee   | Rani      | Manager    | 2005-05-04 |  25000 | 0.06 | 40     |
| 865477 | Dikshit     | Madhuri   | Clerk      | 2002-04-04 |  10000 | 0.02 | 20     |
| 239456 | Khan        | Shahrukh  | Manager    | 2004-01-03 |  30000 | 0.07 | 20     |
| 897889 | Sehwag      | Virender  | Cus_Rep    | 2005-01-02 |  15000 | 0.05 | 20     |
| 123980 | Dhoni       | Mahender  | Clerk      | 2004-10-09 |   9000 | 0.02 | 40     |
| 822134 | Dravid      | Rahul     | Sr Manager | 2000-06-04 |  40000 | 0.08 | 30     |
| 997445 | Dalmia      | Jagmohan  | Clerk      | 2001-07-01 |  12000 | 0.02 | 30     |
| 989007 | Ganguly     | Sourav    | Cus_Rep    | 2002-01-01 |  20000 | 0.03 | 40     |
| 299034 | Ganesan     | Rekha     | Director   | 2002-10-10 |  60000 | 0.11 | 10     |
| 546223 | Karthikeyan | Narayan   | Secretary  | 2005-12-04 |  40000 | 0.09 | 10     |
| 223112 | Mirza       | Sania     | Cus_Rep    | 2001-11-19 |  25000 | 0.04 | 30     |
+--------+-------------+-----------+------------+------------+--------+------+--------+

# **Window function:**

In [116]:
!mysql Soumo_DB -e 'select firstname, jobdesc, SUM(salary) OVER (PARTITION BY jobdesc) as 'Sal_par' from empl'

ERROR 1064 (42000) at line 1: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '(PARTITION BY jobdesc) as Sal_par from empl' at line 1

Window function is not available in this version

# **Miscellaneous** **functions**

**convert function**

In [91]:
!mysql Soumo_DB -e 'select firstname,jobdesc,convert(joindate,date) as date from empl'

+-----------+------------+------------+
| firstname | jobdesc    | date       |
+-----------+------------+------------+
| Amitabh   | Executive  | 2003-03-10 |
| Rani      | Manager    | 2005-05-04 |
| Madhuri   | Clerk      | 2002-04-04 |
| Shahrukh  | Manager    | 2004-01-03 |
| Virender  | Cus_Rep    | 2005-01-02 |
| Mahender  | Clerk      | 2004-10-09 |
| Rahul     | Sr Manager | 2000-06-04 |
| Jagmohan  | Clerk      | 2001-07-01 |
| Sourav    | Cus_Rep    | 2002-01-01 |
| Rekha     | Director   | 2002-10-10 |
| Narayan   | Secretary  | 2005-12-04 |
| Sania     | Cus_Rep    | 2001-11-19 |
+-----------+------------+------------+

**Null function**

In [92]:
!mysql Soumo_DB -e 'select firstname,jobdesc,isnull(lastname) as no_last_name from empl'

+-----------+------------+--------------+
| firstname | jobdesc    | no_last_name |
+-----------+------------+--------------+
| Amitabh   | Executive  |            0 |
| Rani      | Manager    |            0 |
| Madhuri   | Clerk      |            0 |
| Shahrukh  | Manager    |            0 |
| Virender  | Cus_Rep    |            0 |
| Mahender  | Clerk      |            0 |
| Rahul     | Sr Manager |            0 |
| Jagmohan  | Clerk      |            0 |
| Sourav    | Cus_Rep    |            0 |
| Rekha     | Director   |            0 |
| Narayan   | Secretary  |            0 |
| Sania     | Cus_Rep    |            0 |
+-----------+------------+--------------+

**if function**

In [93]:
!mysql Soumo_DB -e 'select firstname,jobdesc,if(salary>30000,"more","less") from empl'

+-----------+------------+--------------------------------+
| firstname | jobdesc    | if(salary>30000,"more","less") |
+-----------+------------+--------------------------------+
| Amitabh   | Executive  | more                           |
| Rani      | Manager    | less                           |
| Madhuri   | Clerk      | less                           |
| Shahrukh  | Manager    | less                           |
| Virender  | Cus_Rep    | less                           |
| Mahender  | Clerk      | less                           |
| Rahul     | Sr Manager | more                           |
| Jagmohan  | Clerk      | less                           |
| Sourav    | Cus_Rep    | less                           |
| Rekha     | Director   | more                           |
| Narayan   | Secretary  | more                           |
| Sania     | Cus_Rep    | less                           |
+-----------+------------+--------------------------------+